# IsUnitLength Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..IsUnitLength Method
XYZ Class See Also
---
The boolean value that indicates whether this vector is of unit length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsUnitLength()
```

Visual Basic
---
```text
Public Function IsUnitLength As Boolean
```

Visual C++
---
```text
public:
bool IsUnitLength()
```

# Remarks
A unit length vector has a length of one, and is considered normalized.
# See Also
XYZ Class
Autodesk.Revit.DB Namespace